zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_EMIOS.h
/*! @name UCDIS - Disable Channel */
/*! @{ */

#define eMIOS_UCDIS_UCDIS0_MASK                  (0x1U)
#define eMIOS_UCDIS_UCDIS0_SHIFT                 (0U)
#define eMIOS_UCDIS_UCDIS0_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS0(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS0_SHIFT)) & eMIOS_UCDIS_UCDIS0_MASK)

#define eMIOS_UCDIS_UCDIS1_MASK                  (0x2U)
#define eMIOS_UCDIS_UCDIS1_SHIFT                 (1U)
#define eMIOS_UCDIS_UCDIS1_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS1(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS1_SHIFT)) & eMIOS_UCDIS_UCDIS1_MASK)

#define eMIOS_UCDIS_UCDIS2_MASK                  (0x4U)
#define eMIOS_UCDIS_UCDIS2_SHIFT                 (2U)
#define eMIOS_UCDIS_UCDIS2_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS2(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS2_SHIFT)) & eMIOS_UCDIS_UCDIS2_MASK)

#define eMIOS_UCDIS_UCDIS3_MASK                  (0x8U)
#define eMIOS_UCDIS_UCDIS3_SHIFT                 (3U)
#define eMIOS_UCDIS_UCDIS3_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS3(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS3_SHIFT)) & eMIOS_UCDIS_UCDIS3_MASK)

#define eMIOS_UCDIS_UCDIS4_MASK                  (0x10U)
#define eMIOS_UCDIS_UCDIS4_SHIFT                 (4U)
#define eMIOS_UCDIS_UCDIS4_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS4(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS4_SHIFT)) & eMIOS_UCDIS_UCDIS4_MASK)

#define eMIOS_UCDIS_UCDIS5_MASK                  (0x20U)
#define eMIOS_UCDIS_UCDIS5_SHIFT                 (5U)
#define eMIOS_UCDIS_UCDIS5_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS5(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS5_SHIFT)) & eMIOS_UCDIS_UCDIS5_MASK)

#define eMIOS_UCDIS_UCDIS6_MASK                  (0x40U)
#define eMIOS_UCDIS_UCDIS6_SHIFT                 (6U)
#define eMIOS_UCDIS_UCDIS6_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS6(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS6_SHIFT)) & eMIOS_UCDIS_UCDIS6_MASK)

#define eMIOS_UCDIS_UCDIS7_MASK                  (0x80U)
#define eMIOS_UCDIS_UCDIS7_SHIFT                 (7U)
#define eMIOS_UCDIS_UCDIS7_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS7(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS7_SHIFT)) & eMIOS_UCDIS_UCDIS7_MASK)

#define eMIOS_UCDIS_UCDIS8_MASK                  (0x100U)
#define eMIOS_UCDIS_UCDIS8_SHIFT                 (8U)
#define eMIOS_UCDIS_UCDIS8_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS8(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS8_SHIFT)) & eMIOS_UCDIS_UCDIS8_MASK)

#define eMIOS_UCDIS_UCDIS9_MASK                  (0x200U)
#define eMIOS_UCDIS_UCDIS9_SHIFT                 (9U)
#define eMIOS_UCDIS_UCDIS9_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS9(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS9_SHIFT)) & eMIOS_UCDIS_UCDIS9_MASK)

#define eMIOS_UCDIS_UCDIS10_MASK                 (0x400U)
#define eMIOS_UCDIS_UCDIS10_SHIFT                (10U)
#define eMIOS_UCDIS_UCDIS10_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS10(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS10_SHIFT)) & eMIOS_UCDIS_UCDIS10_MASK)

#define eMIOS_UCDIS_UCDIS11_MASK                 (0x800U)
#define eMIOS_UCDIS_UCDIS11_SHIFT                (11U)
#define eMIOS_UCDIS_UCDIS11_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS11(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS11_SHIFT)) & eMIOS_UCDIS_UCDIS11_MASK)

#define eMIOS_UCDIS_UCDIS12_MASK                 (0x1000U)
#define eMIOS_UCDIS_UCDIS12_SHIFT                (12U)
#define eMIOS_UCDIS_UCDIS12_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS12(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS12_SHIFT)) & eMIOS_UCDIS_UCDIS12_MASK)

#define eMIOS_UCDIS_UCDIS13_MASK                 (0x2000U)
#define eMIOS_UCDIS_UCDIS13_SHIFT                (13U)
#define eMIOS_UCDIS_UCDIS13_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS13(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS13_SHIFT)) & eMIOS_UCDIS_UCDIS13_MASK)

#define eMIOS_UCDIS_UCDIS14_MASK                 (0x4000U)
#define eMIOS_UCDIS_UCDIS14_SHIFT                (14U)
#define eMIOS_UCDIS_UCDIS14_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS14(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS14_SHIFT)) & eMIOS_UCDIS_UCDIS14_MASK)

#define eMIOS_UCDIS_UCDIS15_MASK                 (0x8000U)
#define eMIOS_UCDIS_UCDIS15_SHIFT                (15U)
#define eMIOS_UCDIS_UCDIS15_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS15(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS15_SHIFT)) & eMIOS_UCDIS_UCDIS15_MASK)

#define eMIOS_UCDIS_UCDIS16_MASK                 (0x10000U)
#define eMIOS_UCDIS_UCDIS16_SHIFT                (16U)
#define eMIOS_UCDIS_UCDIS16_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS16(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS16_SHIFT)) & eMIOS_UCDIS_UCDIS16_MASK)

#define eMIOS_UCDIS_UCDIS17_MASK                 (0x20000U)
#define eMIOS_UCDIS_UCDIS17_SHIFT                (17U)
#define eMIOS_UCDIS_UCDIS17_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS17(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS17_SHIFT)) & eMIOS_UCDIS_UCDIS17_MASK)

#define eMIOS_UCDIS_UCDIS18_MASK                 (0x40000U)
#define eMIOS_UCDIS_UCDIS18_SHIFT                (18U)
#define eMIOS_UCDIS_UCDIS18_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS18(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS18_SHIFT)) & eMIOS_UCDIS_UCDIS18_MASK)

#define eMIOS_UCDIS_UCDIS19_MASK                 (0x80000U)
#define eMIOS_UCDIS_UCDIS19_SHIFT                (19U)
#define eMIOS_UCDIS_UCDIS19_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS19(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS19_SHIFT)) & eMIOS_UCDIS_UCDIS19_MASK)

#define eMIOS_UCDIS_UCDIS20_MASK                 (0x100000U)
#define eMIOS_UCDIS_UCDIS20_SHIFT                (20U)
#define eMIOS_UCDIS_UCDIS20_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS20(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS20_SHIFT)) & eMIOS_UCDIS_UCDIS20_MASK)

#define eMIOS_UCDIS_UCDIS21_MASK                 (0x200000U)
#define eMIOS_UCDIS_UCDIS21_SHIFT                (21U)
#define eMIOS_UCDIS_UCDIS21_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS21(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS21_SHIFT)) & eMIOS_UCDIS_UCDIS21_MASK)

#define eMIOS_UCDIS_UCDIS22_MASK                 (0x400000U)
#define eMIOS_UCDIS_UCDIS22_SHIFT                (22U)
#define eMIOS_UCDIS_UCDIS22_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS22(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS22_SHIFT)) & eMIOS_UCDIS_UCDIS22_MASK)

#define eMIOS_UCDIS_UCDIS23_MASK                 (0x800000U)
#define eMIOS_UCDIS_UCDIS23_SHIFT                (23U)
#define eMIOS_UCDIS_UCDIS23_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS23(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS23_SHIFT)) & eMIOS_UCDIS_UCDIS23_MASK)
/*! @} */

